# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
srs1 = pd.Series([np.random.randint(1,5) for i in range(100)])
#pd.Series() creates essentially a table with index column and any type of data in the other
srs2 = pd.Series([np.random.randint(1,4) for i in range(100)])
#np.random.randint() will allow us to do random sampling for the amount of values indicated
#the low/start values are inclusive and the high/end values are exclusive
srs3 = pd.Series([np.random.randint(10000,30001) for i in range(100)])
#fo i in range will help us create a list of 100 of those random values

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
pd.concat([srs1, srs2, srs3], axis=1)
#pd.concat() will allow us to unite the three series
#specifying the axis as 1 joins by column (next to) rather than row (beneath)

#another way to obtain the answer, which includes naming the columns, is highlighted below
#srsset={"Series One":srs1, "Series Two":srs2,"Series Three":srs3}
#pd.concat(srsset, axis=1)

    0  1      2
0   2  2  26120
1   2  1  13959
2   4  1  21452
3   1  1  22171
4   1  1  12779
.. .. ..    ...
95  4  1  20581
96  3  1  24028
97  3  3  10636
98  4  2  16456
99  3  3  28549

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
srsset={"bedrs":srs1, "bathrs":srs2,"price_sqr_meter":srs3}
#to change the column/series name, create a dictionary 
#with the new key=name and the value=series it represents
pd.concat(srsset, axis=1)
#as a variable was not created to continue using the previous concatination
#repeat the combining of the data as above

    bedrs  bathrs  price_sqr_meter
0       2       2            26120
1       2       1            13959
2       4       1            21452
3       1       1            22171
4       1       1            12779
..    ...     ...              ...
95      4       1            20581
96      3       1            24028
97      3       3            10636
98      4       2            16456
99      3       3            28549

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [13]:
bigcolumn = pd.DataFrame(pd.concat([srs1, srs2, srs3], axis=0))
#here we combinet the three series but with and axis value of 0
#the 0, which is the default, with stack the data in one column
#there is the option to print as a dataframe by a includinf pd.DataFrame()
bigcolumn
#another way to obtain the answer using the previously created variable is highligted below
#concat = pd.concat(srsset, axis=0)
#bigcolumn = pd.DataFrame(concat)

                        0
bedrs           0       2
                1       2
                2       4
                3       1
                4       1
...                   ...
price_sqr_meter 95  20581
                96  24028
                97  10636
                98  16456
                99  28549

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [6]:
#No it has 300 rows
#the issue is each series has a max index of 99
#they are stacked on top of each other

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [7]:
bigcolumn.reset_index(drop=True, inplace=True)
#to reindex we use .reset_index()
# to maintain the chage we drop the previous index and set the new one in place
bigcolumn

0          2
1          2
2          4
3          1
4          1
       ...
295    20581
296    24028
297    10636
298    16456
299    28549
Length: 300, dtype: int64